import pytest

from src.masks import get_mask_account, get_mask_card_number


@pytest.mark.parametrize(
    "card_number, expected",
    [
        ("1234 5678 9012 3456", "1234 56** **** 3456"),
        ("1234567890123456", "1234 56** **** 3456"),
        (" 1234-5678-9012-3456 ", "1234 56** **** 3456"),
        ("1234", "Введен некорректный номер."),
        ("123", "Введен некорректный номер."),
        ("12", "Введен некорректный номер."),
        ("abc", "Введен некорректный номер."),
        (" ", "Введен некорректный номер."),
        ("", "Введен некорректный номер."),
    ],
)
def test_get_mask_card_number(card_number: str, expected: str) -> None:
    assert get_mask_card_number(card_number) == expected


@pytest.mark.parametrize(
    "account_number, expected",
    [
        ("12345678901234567890", "**7890"),
        (" 1234 5678 9012 3456 7890 ", "**7890"),
        (" 1234-5678-9012-3456-7890", "**7890"),
        (" 12345678901234567890 ", "**7890"),
        ("1234", "Введен некорректный номер."),
        ("1234567890", "Введен некорректный номер."),
        (" 1234-5678-9012-3456 ", "Введен некорректный номер."),
        ("123", "Введен некорректный номер."),
        ("12", "Введен некорректный номер."),
        ("abc", "Введен некорректный номер."),
        (" ", "Введен некорректный номер."),
        ("", "Введен некорректный номер."),
    ],
)
def test_get_mask_account(account_number: str, expected: str) -> None:
    assert get_mask_account(account_number) == expected


if __name__ == "__main__":
    pytest.main()
